print("Жанры Аниме и их лучшие произведения")
a=("1.Иссекай")
print(a)
b=("2.Меха")
print(b)
c=("3.сенен")
print(c)
d=("4.Комедия")
print(d)
n = int(input("жанр= "))
a = 1
while a < 2:
    if n == 1:
        print("1.Re-Zero")
        print("2.Мастер меча онлайн")
        print("3.О моем перерождении в слизь")
        k = int(input("какое аниме вас интересует = "))
        if k == 1:
            print(
                "1.главный герой, геймер и хикикомори Субару Нацуки, возвращаясь из продуктового магазина попадает в параллельный фэнтезийный мир. ")
            print(
                "Стараясь вести себя по знакомым ему игровым лекалам, он пытается использовать магию и ожидает встречи с призвавшей его красавицей,")
            print(
                "но всё идёт не совсем по его планам. В этой арке Субару открывает свою способность — возвращаться в прошлое после смерти,")
            print(
                "знакомится с Эмилией, её духом Паком, лавочником Кадомоном, воровкой Фельт и её опекуном — ломбардщиком Ромом. ")
            print(
                "События арки построены вокруг магического значка участника королевских выборов, украденного у Эмилии, а также борьбы с наёмной")
            print("убийцей Эльзой, три раза Субару оказывается убит.")
        if k == 2:
            print(
                "2. 6 ноября 2022 года, Sword Art Online (SAO) стала первой выпущенной на рынок VRMMORPG — Virtual Reality Massively Multiplayer Online")
            print(
                " Role-Playing Game (Массовая многопользовательская ролевая онлайн-игра c полным погружением). Виртуальная игровая среда, ")
            print(
                "разработанная компанией «Аргус», представляла собой колоссальную сто уровневую крепость Айнкрад, парящую в небесах. ")
            print(
                "Первый же день игры после двух месяцев бета-тестирования обещал стать событием в мире игровой индустрии и действительно стал им… ")
            print(
                "однако совсем не таким, как хотелось бы общественности и тем более пользователям этой игры. Десять тысяч игроков, ")
            print("вошедших на сервер SAO, внезапно обнаружили отсутствие кнопки «Выйти из системы» в системном меню. ")
            print(
                "Последовавшее позднее объявление от создателя технологии Полного Погружения и игры Sword Art Online Акихико Каябы превзошло самые худшие ")
            print(
                "предположения — пользователи были намеренно лишены возможности покинуть виртуальный мир до тех пор, пока кем-нибудь из игроков не будет ")
            print(
                "покорён сотый уровень Айнкрада. Более того — попытка снять шлем виртуального погружения кем-нибудь в реальном мире ")
            print(
                "(ни один из пользователей не смог сделать этого самостоятельно: погружённый в «виртуальность» в реальности не может пошевелить даже пальцем), ")
            print(
                "приводит к мгновенной смерти в результате микроволнового разряда в мозг. И самое худшее — смерть игрового персонажа в виртуальной среде ")
            print("приводит к самой настоящей смерти игрока в реальном мире.")
        if k == 3:
            print(
                "Знакомьтесь! Сатору Миками, 37-летний рядовой служащий крупной финансовой компании, ныне мечтающий лишь об одном — о девушке. ")
            print(
                "Однако встреча с приятелем на улице обернулась для Сатору трагедией, перечеркнув все планы: грабитель с ножом бросился на ")
            print("товарища, а Сатору принял на себя удар...")
            print(
                "Но жизнь для Миками на этом не закончилась. Мужчина переродился в другом мире. Перед смертью он подумал о том, ")
            print(
                "как плохо человеку от потери крови, а после перерождения получил... тело слизня, в котором эта жидкая красная ")
            print(
                "субстанция попросту отсутствует. Но что может сделать в огромном незнакомом мире, пускай и разумная, но слизь?")
    if n == 2:
        print("1.Евангелион")
        print("2.Гурен Лаган")
        print("3.86")
        k = int(input("какое аниме вас интересует = "))
        if k == 1:
            print("Аниме и манга повествуют о борьбе организации Nerv с таинственными созданиями — «Ангелами»,")
            print(" по неизвестным причинам нападающими на человечество.")
            print(" С целью защиты от вторжения Ангелов используются биороботы «Евангелионы»,")
            print(
                " разработанные предшественницей Nerv — Gehirn. Управлять этими роботами могут только некоторые 14-летние подростки,")
            print(" именуемые «Детьми» или «Дитя», когда речь идёт об отдельном пилоте.")
        if k == 2:
            print(
                "В далёком будущем человечество живёт общинами глубоко под землёй в пещерах, не зная о мире на поверхности, о небе и звёздах. ")
            print(
                "В одной из таких общин живут Симон и его друг Камина. Вместе они называют себя «Гуррен-Дан» (досл. «Бригада Гуррен»). ")
            print("Камина мечтает покинуть пещеры и выбраться на поверхность, в существование которой верят немногие.")
            print(
                "Старейшина деревни не верит в подобную ерунду и сурово наказывает членов «Бригады». Но всё меняется, ")
            print(
                "когда Симон находит ключ от странного устройства, и одновременно с этим происходит обвал пещеры над деревней — ")
            print(
                "всё поселение оказывается в опасности. Теперь Симону, Камине и девушке Ёко, пришедшей с поверхности, предстоит спасти деревню.")
            print("Так начинается история о приключениях Симона и Камины в мире под открытым небом.")
        if k == 3:
            print(
                "Долгое время Республика Сан-Магнолия находится в военном конфликте с Империей, соседним государством, которое создало серию беспилотных военных машин. ")
            print(
                "В ответ на угрозу республика успешно завершает разработку аналогичной технологии и отражает атаку противника, сумев обойтись без жертв. ")
            print(
                "Однако это... официальная версия. На самом деле жертвы были. За пределами известных восьмидесяти пяти районов республики фактически был ещё один, ")
            print(
                "«несуществующий» 86-й округ. Именно там днём и ночью шли бои, в которых принимали участие члены отряда «Восемьдесят шесть», управляя беспилотниками.")
            print(
                "Встаёт закономерный вопрос: сможет ли государственный строй, при котором правительство беспокоится только о личной выгоде, привести государство к процветанию? ")
            print(
                "Ждёт ли счастье участников военных действий, что с той, что с другой стороны, которые каждый день рискуют жизнями и теряют друзей и близких? ")
            print(
                "Безнаказанны ли останутся те, кто находится далеко от поля битвы, где им не угрожает опасность, благодаря чему они начинают думать, ")
            print("что война не так уж и страшна, а даже забавна.")
    if n == 3:
        print("1.Наруто")
        print("2.Черный Клевер")
        print("3.Человек Бензопила")
        k = int(input("какое аниме вас интересует = "))
        if k == 1:
            print(
                "В день рождения Наруто Узумаки на деревню под названием Коноха напал легендарный демон, Девятихвостый лис. ")
            print(
                "Четвёртый Хокагэ ценой своей жизни спас деревню, запечатав демона в новорождённом Наруто, неосознанно обрекая его на жизнь ")
            print(
                "в ненависти односельчан.Несмотря на недостаток таланта во многих областях ниндзюцу, неусидчивость и задиристость, ")
            print(
                "у Наруто есть мечта — стать Хокагэ, сильнейшим ниндзя в деревне. Желая признания, которого не получал, он упорно работает и тренируется ")
            print(
                "вместе со своими напарниками, Саскэ Учихой и Сакурой Харуно, а также со своим наставником Какаши Хатакэ. ")
            print(
                "Ему и его напарникам придётся пройти через многое по пути к своим заветным мечтам: сражения, любовь, дружба, предательство, жажда силы...")
        if k == 2:
            print(
                "Ещё детьми Аста и Юно были оставлены у порога церкви в глухой деревушке. Мальчики пообещали друг другу, ")
            print(
                "что один из них станет Королём магов. Однако чем старше они становились, тем больше различий между ними появлялось. ")
            print(
                "Юно был гением магии, а Аста тренировал своё тело лишь физически. Когда им исполнилось по 15 лет, пришло время получать гримуары. ")
            print(
                "Юно стал обладателем книги с четырёхлистным клевером (большинство людей получают книги с трёхлистным), ")
            print(
                "в то время как Аста не получил ничего. Однако, когда Юно угрожала опасность, Аста раскрыл свою истинную силу. ")
            print("В итоге парень стал обладателем гримуара с пятилистным клевером под названием «Чёрный клевер»! ")
            print("Теперь два друга путешествуют по миру, чтобы достичь одну и ту же цель.")
        if k == 3:
            print("У Дэндзи есть мечта — жить мирной и счастливой жизнью, проводя время с любимой девушкой. ")
            print("Однако суровая реальность в лице некоего якудзы заставляет парня вернуться с небес на землю, ")
            print(
                "ведь он вынужден убивать демонов, чтобы расплатиться с необъятными долгами покойного отца. Вместе со своим ")
            print(
                "дьявольским питомцем Почитой, которого использует в качестве оружия, Дэндзи готов сделать что угодно, даже за небольшую плату. ")
            print(
                "Вскоре парень изжил свою полезность и был убит демоном, заключившим контракт с якудзой. Но верный Почита спасает своего хозяина, ")
            print(
                "заключив с ним контракт. Почита стал одним целым с умирающим Дэндзи, заменив ему сердце, и подарил ему силы человека-бензопилы. ")
            print(
                "Теперь переродившийся Дэндзи, получив умение превращать части своего тела в бензопилы, использует новообретённые способности, ")
            print(
                "чтобы быстро и жестоко расправляться с врагами. Попав под внимание Бюро общественной безопасности, парень получает ")
            print(
                "работу охотника на демонов. Отныне, не страшась даже самых жестоких противников, Дэндзи не остановится ни перед чем, ")
            print("чтобы воплотить в жизнь свои мечты.")
    if n == 4:
        print("1.Необъятный океан")
        print("2.Коносуба")
        print("3.Этот герой неуезвимый но очень осторожен")
        k = int(input("какое аниме вас интересует = "))
        if k == 1:
            print(
                "У Иори Китахары начинается новая жизнь после поступления в престижный колледж в приморском городке Идзу-Сити. ")
            print("Парень снимает комнату у семьи Котэгава, владеющей магазином снаряжения для дайвинга «Grand Blue». ")
            print(
                "Но вся эта тема Иори не нравится: он до ужаса боится воды и предпочитает с морским делом не связываться. Однако, ")
            print(
                "познакомившись с компанией дайверов, юноша меняет свои взгляды, пытается перебороть свой страх и открыть для себя ")
            print("бескрайние просторы необъятного океана!")
        if k == 2:
            print(
                "Так уж получилось, что жизнь Казумы Сато, хикикомори, увлечённого видеоиграми, оборвалась в результате дорожно-транспортного происшествия. ")
            print(
                "Такая вот суровая плата за хороший поступок, за спасение человека. Однако, очнувшись, парень вдруг понял, что жив-здоров, ")
            print(
                "а перед собой увидел симпатичную девушку, Акву, представившуюся богиней. Вопреки ожиданиям, богиня не произнесла, мол: «Ну-ка, ")
            print(
                "парень, сгруппируйся, сейчас тебя на небеса отправим!» Напротив, девушка едва ли не сразу стала объяснять, что ищет героя, ")
            print(
                "способного победить какого-то-там злобного Владыку демонов и тем самым спасти какой-то-там другой мир. И уж больно этот ")
            print(
                "«какой-то-там» мир был похож на видеоигру. Что, безусловно, подкупало. «Значит, гляди, — продолжала Аква. — Если согласишься, ")
            print(
                "можешь взять с собой одну любую вещь или способность. Хочешь, меч из хвоста неведомого чудовища, а хочешь — силу горного великана. ")
            print(
                "Ну так что выбираешь?» Долго Казума думать не стал. «Выбираю тебя!» — сообразил он, чем тут же выбил навязчивую богиню из колеи. ")
            print(
                "Так начинаются приключения странного хикикомори и незадачливой богини по чужому и неприветливому миру, где Казума попытается ")
            print("начать новую мирную жизнь, на время позабыв, что зло здесь никогда не дремлет.")
        if k == 3:
            print(
                "Богиня Листарте, спасительница мира Геабуранде, вызывает на помощь героя. И что неудивительно, он появляется. ")
            print(
                "Героя зовут Сэйя Рюгуин, и он мастер в играх, вот только до смешного осторожен. Например, парень купил три комплекта доспехов: ")
            print(
                "один для ношения, второй — про запас и запасной для запасного. Помимо того, что копит несметное количество предметов, ")
            print(
                "Сэйя сидит в комнате и не занимается ничем, кроме постоянных физических тренировок. А всё ради того, чтобы набрать максимально ")
            print("возможную мощь и сражаться только будучи полностью уверенным в победе. Главное — никакого риска!")
    if n > 4:
        print("мы еще не добавили другие жанры")
    a=int(input("Интересны ли вам еще какие нибудь аниме из этого жанра?[1=Да.2=Нет]"))

print("Спасибо что поситили нас!!!")



